[
  {
    "job_id": "remoteok_1093874",
    "title": "Amazon Connect IVR QA R01553996",
    "company": "Brillio",
    "location": "Remote",
    "description": "<p><b>About Brillio: </b></p><p><br></p><p>Brillio is one of the fastest growing digital technology service providers and a partner of choice for many Fortune 1000 companies seeking to turn disruption into a competitive advantage through innovative digital adoption.&nbsp;Brillio, renowned for its world-class professionals, referred to as \"Brillians\", distinguishes itself through their capacity to seamlessly integrate cutting-edge digital and design thinking skills with an unwavering dedication to client satisfaction. </p><p>Brillio takes pride in its status as an employer of choice, consistently attracting the most exceptional and talented individuals due to its unwavering emphasis on contemporary, groundbreaking technologies, and exclusive digital projects. Brillio's relentless commitment to providing an exceptional experience to its Brillians and nurturing their full potential consistently garners them the Great Place to WorkÂ® certification year after year.</p><p><br></p><p><u><b>Consultant</b></u></p>\\n<p></p><p><br></p><b>Primary Skills</b><ul><li>AWS Elastic Beanstalk, AWS Lambda, Amazon CloudFront, Amazon API Gateway, AWS Step Function </li></ul><p><br></p><b>Specialization</b><ul><li>AWS Development: Senior Lead Engineer </li></ul><p><br></p><b>Job requirements</b><div>Job Title: Automation Test Engineer â\u0080\u0093 Amazon Connect, IVR, Cyara</div><div>Overview:</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are seeking a skilled Automation Test Engineer with deep expertise in Amazon Connect, IVR systems, and Cyara. The role involves designing, developing, and executing automated tests to ensure the reliability and performance of contact center solutions.</div><div>Key Responsibilities:</div><div>1. Test Automation &amp; Execution</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Design and maintain automated test scripts for Amazon Connect call flows.</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Use Cyara to simulate real-world voice interactions and stress-test IVR components.</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Validate performance and functionality of contact center solutions.</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Integrate API-based tests (e.g., using Postman or custom scripts) for inbound/outbound call simulations.</div><div>2. Test Management &amp; Reporting</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Develop and manage test cases, plans, and suites using QTest.</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Track defects, analyze test results, and report quality metrics.</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Collaborate with QA and development teams to resolve issues and improve testing processes.</div><div>3. Collaboration &amp; Continuous Improvement</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Work with cross-functional teams (developers, product managers, operations) to integrate testing into the CI/CD pipeline.</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Participate in agile ceremonies and contribute to refining testing strategies.</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Stay updated on testing trends and best practices.</div><div>4. Documentation &amp; Compliance</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ensure all test documentation is complete and adheres to industry standards.</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Contribute to technical documentation and internal training materials.</div><div>&nbsp;</div><div>Required Qualifications:</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 5+ years of experience in software testing with a focus on automation.</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Hands-on experience with Amazon Connect and IVR testing.</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Proven expertise in Cyara for automated contact center testing.</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Experience with QTest for test case and defect management.</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Proficiency in scripting languages like Python, Java, or JavaScript.</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Familiarity with API testing and CI/CD integration.</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Strong analytical and communication skills.</div><div>Preferred Qualifications:</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Experience with additional automation tools and frameworks.</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Knowledge of broader AWS services.</div><div>Â·&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Certifications in software testing or QA</div><p><br></p><p></p>\\n<div>$70 - $75 an hour</div><small><div>Equal Employment Opportunity Declaration</div><div>Brillio is an equal opportunity employer to all, regardless of age, ancestry, colour, disability (mental and physical), exercising the right to family care and medical leave, gender, gender expression, gender identity, genetic information, marital status, medical condition, military or veteran status, national origin, political affiliation, race, religious creed, sex (includes pregnancy, childbirth, breastfeeding, and related medical conditions), and sexual orientation.&nbsp;</div><div><br></div><div>#LI-PS1</div></small>\\n<p>Know more about Brillio : https://www.brillio.com/join-us/</p><p><br></p><p>PPE: https://www.brillio.com/platform-and-product-engineering/</p><p><br></p><p><br></p><p><span style=\"font-size: 10pt;\">&nbsp;</span></p><p><span style=\"font-size: 10pt;\">Know what itâ\u0080\u0099s like to work and grow at Brillio: </span><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.brillio.com\">Click here</a></p><br/><br/>Please mention the word **DETACHABLE** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "requirements": [
      "amazon",
      "design",
      "training",
      "technical",
      "software",
      "testing",
      "test",
      "voice",
      "qa",
      "api",
      "management",
      "lead",
      "senior",
      "reliability",
      "engineer",
      "digital nomad"
    ],
    "salary_min": 60000,
    "salary_max": 140000,
    "job_type": "Full-time",
    "remote": true,
    "posted_date": "2025-08-19T20:00:31",
    "source": "RemoteOK",
    "url": "https://remoteOK.com/remote-jobs/remote-amazon-connect-ivr-qa-r01553996-brillio-1093874",
    "seniority_level": "Senior"
  },
  {
    "job_id": "remoteok_1093873",
    "title": "Account Executive",
    "company": "Cority",
    "location": "Remote",
    "description": "<p>Cority is the global enterprise EHS software provider creating industry-leading technology to empower those who transform the way the world works. </p><p>&nbsp;</p><p>For over 35 years, Cority has been powered by the spirit of innovation, deep domain expertise, and a commitment to integrity that enables higher levels of operational and sustainable performance with the most comprehensive, human-centered, and secure SaaS platform to help workers and businesses thrive in 100 countries around the world. </p><p>&nbsp;</p><p>The company enjoys the industryâ\u0080\u0099s highest levels of client satisfaction and has received many awards for its strong employee culture and outstanding business performance. To learn more, visit <a class=\"postings-link\" href=\"http://www.cority.com/\">www.cority.com</a>.</p><p><br></p><p>As a part of the company that is growing and helping health professionals be more efficient at their jobs, the Account Executive is responsible to meet revenue and profitability objectives through the development and execution of sales strategies which maximize the potential of our EHSQ software suite.</p>\\n<p></p><p><br></p><b>Primary Responsibilities:</b><ul><li>Manage the sales process from prospecting to qualification through contract close through diligent follow up on prospective accounts</li><li>Develop and maintain professional relationships with prospective clients within the territory in our target markets</li><li>Create demand and continuously seek out opportunities to market and sell the Cority suite of EHSQ products</li><li>Manage the RFI, RFP and Proposal process working closely with other internal and external teams </li><li>Provide the Director, Sales with visibility on the sales pipeline and forecasted revenue</li><li>Develop, maintain and leverage your personal and corporate network to create sales opportunities.</li><li>In conjunction with the Director, Sales create territory strategies and strategic account plans in support of annual goal achievement</li><li>Obtain and communicate market intelligence back to internal stakeholders</li><li>Attend and participate at industry conferences and events</li><li>Identify and develop relationships with strategic partners as necessary</li><li>Collaborate with internal teams in the marketing, client services, development, legal and finance areas in support of our world class sales culture</li></ul><p><br></p><b>Qualifications:</b><ul><li>Minimum 5+ years of enterprise solution sales experience with strong track record of hunting and closing SaaS, software and consulting services agreements</li><li>Industry sales experience an asset</li><li>Advanced computer skills: Microsoft Word, Excel, PowerPoint, CRM. </li><li>Must have an ability to work independently as well as on a team in a collaborative environment and have excellent understanding of strategic selling techniques</li><li>Must possess strong time management skills and understand pipeline management, CRM and forecasting principles</li><li>Possess excellent written, verbal communications and presentation skills in managing all aspects of the sales cycle with a polished executive presence.&nbsp;&nbsp;</li></ul><p><br></p><p></p>\\n<p><b>WHATâ\u0080\u0099S IN IT FOR YOU?</b></p><p>&nbsp;</p><p>Â·<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>An opportunity to work in a values-driven, performance oriented, dynamic and growth focused culture</p><p>Â·<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>We support a remote working environment with a one-time home office allowance and subsidized monthly internet allowance </p><p>Â·<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Competitive health benefits, dental plans, and retirement savings plan (RRSP, 401K plan etc.)</p><p>Â·<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Annual fitness allowance </p><p>Â·<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Mental health support provided through access to Calm Premium meditation app and access to Talkspace </p><p>Â·<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Access to Udemy, internal training programs, annual training allowance and certifications, if applicable, and High Talent Programs &nbsp;</p><p>&nbsp;</p><p><br></p><p>Cority is committed to a diverse and inclusive work environment. Cority is an equal opportunity employer and does not discriminate based on race, nationality, gender, gender identity, sexual orientation, protected veteran status, age, disability or any other legally protected status. For applicants who would like to request for accommodation please send an email to hr@cority.com.</p><br/><br/>Please mention the word **CLEARS** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "requirements": [
      "saas",
      "training",
      "consulting",
      "support",
      "software",
      "growth",
      "finance",
      "microsoft",
      "management",
      "operational",
      "legal",
      "sales",
      "health",
      "executive"
    ],
    "salary_min": 100000,
    "salary_max": 150000,
    "job_type": "Full-time",
    "remote": true,
    "posted_date": "2025-08-19T20:00:20",
    "source": "RemoteOK",
    "url": "https://remoteOK.com/remote-jobs/remote-account-executive-cority-1093873",
    "seniority_level": "Senior"
  },
  {
    "job_id": "remoteok_1093872",
    "title": "Strategic Accounts Sales Representative",
    "company": "PROCEPT BioRobotics",
    "location": "Remote",
    "description": "<p><b>Company Overview</b></p><p>Embark on an enriching journey with PROCEPT BioRobotics, where our vision, mission, and values guide everything we do as a company. We are committed to revolutionizing treatment for benign prostatic hyperplasia (BPH, otherwise known as prostate gland enlargement) through innovation in surgical robotics. As our company succeeds and grows, we improve the quality of life of patients, provide more effective treatment options for surgeons, uphold the trust of our shareholders. That starts with a commitment to our People with a focus on creating an evolving landscape for your career, brimming with transformative opportunities that provide continuous career growth opportunities.</p><p><br></p><p><b>The Opportunity That Awaits You: &nbsp;&nbsp;</b></p><p><b style=\"font-size: 6pt;\">&nbsp;</b></p><p>The <b>Strategic Accounts Sales Representative</b> (SASR) is responsible for managing and expanding strategic relationships with integrated delivery networks (IDNs). The SASR &nbsp;serves as a trusted partner to key stakeholders, aligning PROCEPTâ\u0080\u0099s offerings with customer needs to drive long-term growth and market share. This role will ensure seamless post-sale integration, utilization optimization, and contract alignment across key accounts.</p>\\n<p></p><p><br></p><b>What Your Day-To-Day Will Involve:</b><ul><li>&nbsp;&nbsp;Provide a single point of contact for all assigned IDN groups</li><li>&nbsp; Responsible for both maintaining and growing business in contracted groups</li><li> Cross-collaboration with PROCEPTâ\u0080\u0099s Comm Ops, National Strategic Accounts Manager and Marketing teams to build presentations for hospital executive meetings and IDN-specific marketing events for local program clinical and administrative support</li></ul><ul><li>Develop KOLs &amp; key relationships in targeted accounts </li><li>Active involvement in the weekly and quarterly sales planning process</li><li>Support the expansion of clinical usage in all accounts â\u0080\u0093 identify and train new surgeon users; grow existing user procedural business</li><li>Partner with IDN Physician Relations, Business Development, and marketing teams to drive awareness, trial, and usage</li></ul><ul><li> Identify local billing and coding alignment &amp; collaborate with internal Field Reimbursement resources to address opportunities</li><li>Cross-collaboration with local Capital, Clinical, and Utilization teams for program growth and to identify opportunities (i.e., block time utilization, in-office patient identification strategies)</li><li>Establish, assess and leverage IDN dashboards for strategic physician and account targets </li><li>Cultivate and maintain positive relationships throughout PROCEPT-BioRobotics&nbsp;</li></ul><p><br></p><b>The Qualifications We Need You to Possess:</b><ul><li>Bachelorâ\u0080\u0099s degree in business, healthcare, or related field</li><li>&nbsp;Minimum 8 years of experience in medical device/capital sales, healthcare consulting, or physician practice development.</li><li>Prior exposure to Urology, BPH treatment pathways, or previous sales engagement or involvement with IDNs preferred.</li><li>Demonstrated success in driving the adoption of clinical solutions or programs within IDNs to yield significant growth in utilization.</li><li>Strong communication, project management, independent thinking, and problem-solving skills.</li><li>Demonstrated skills collaborating with multiple teams and stakeholders within a set geography.</li><li>Comfortable leading structured initiatives in complex, multi-stakeholder environments.</li><li>Ability to travel up to 75%.</li><li>Internal candidates must be meeting or exceeding expectations in their current role with a track record of achieving all the above requirements and a willingness to travel as defined.&nbsp;</li></ul><p><br></p><b>The Qualifications we would Like You to Posses:</b><ul><li>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Experience presenting to Hospital Executive Leadership</li><li>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Experience implementing and executing office growth strategies within the healthcare space.</li><li>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ability to analyze and interpret procedural data and translate insights into action.</li><li>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Exceptional communication and computer skills, proficient in Excel. </li><li>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Entrepreneurial mindset with a passion for innovation and patient impact.</li><li>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Demonstrated change management skills in a strategic environment â\u0080\u0093 previous examples from prior work experience are \tencouraged.</li><li>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The ability to follow a defined sales process to influence health care professionals to increase Aquablation utilization.</li></ul><p><br></p><b>PHYSICAL DEMANDS &amp; WORK ENVIRONMENT</b><ul><li>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions</li><li>To perform this duty the employee must have the ability to sit or stand at and operate a computer terminal and walk or travel safely within the facility. The employee may occasionally lift and/or move up to 15 pounds</li><li>While performing the duties of this job, the employee regularly works in an office environment</li><li>The employee might occasionally be exposed to clinical operating rooms, for which proper personal protection equipment will be assigned and worn</li></ul><p><br></p><p></p>\\n<p><b>For US Based Candidates Only</b></p><p>For this role, the anticipated base pay is $120,000 a year.</p><p>&nbsp;</p><p>PROCEPT BioRobotics is committed to fair and equitable compensation practices and we aim to provide employees with total compensation packages that are market competitive. In addition to base salary, our positions are eligible for variable compensation through one of our incentive plans as well as equity compensation based on role and level. PROCEPT also offers a comprehensive suite of benefits including, but not limited to, health insurance plans, ESPP, 401k retirement savings plan with a company match, and paid time off programs. All compensation and benefits programs are subject to the discretion of the company.</p><p><br></p><p><b>Understanding PROCEPT's Culture</b></p><p>At <b>PROCEPT</b>, we believe every person matters. Every employee, every patient, every caregiver. Because we are here to create a revolution, and we believe in doing that by innovating everywhere with pathological optimism. We believe in being humble and highly engaged in the work we do, while also working together seamlessly for a common goal. At Procept, curiosity, ingenuity and conviction in the power technology will transform the lives of our patients and providers.</p><p>&nbsp;</p><p>And this doesnâ\u0080\u0099t happen by accident. It starts with our live induction program that serves as an incubator for cross-functional team building, an immersion in Proceptâ\u0080\u0099s history, jam-packed interactive sessions with executive leadership and a crash-course in the mission and purpose of what we do. It continues with our one-of-a-kind management program designed to build the best managers in the industry, where our people managers across functions come together to exchange ideas and grow, as both managers and learners, in an environment that challenges, supports and broadens.</p><p>&nbsp;</p><p>We are fueled by the opportunity to give people their lives back. And we believe that it begins with YOU! At Procept, we push beyond just finding a work/life balance, we strive to find a work/life blend, a professional world that you are honored and impassioned to belong to, one that you can proudly share with your family, friends, and acquaintances. </p><p>&nbsp;</p><p>An opportunity at PROCEPT BioRobotics wonâ\u0080\u0099t just be about finding a job. It will be an opportunity for you to join a community devoted to making a difference in this world!</p><p>&nbsp;</p><p><b>BENEFITS OF WORKING AT PROCEPT!</b>&nbsp;</p><p><b>PROCEPTâ\u0080\u0099s </b>health and wellness benefits for employees are second to none in the industry. As an organization, one of our top priorities is to maintain the health and wellbeing of our employees and their families. We offer a comprehensive benefits package that includes full medical coverage, wellness programs, on-site gym, a 401(k) plan with employer match, short-term and long-term disability coverage, basic life insurance, wellbeing benefits, flexible or paid time off, paid parental leave, paid holidays, and many more! </p><p><br></p><p><b>EQUAL EMPLOYMENT OPPORTUNITY STATEMENT</b></p><p>PROCEPT BioRobotics is an equal opportunity employer that is committed to diversity and inclusion in the workplace. We prohibit discrimination and harassment of any kind on the basis of race, color, national origin, religion, gender, gender identity, sexual orientation, disability, genetic information, pregnancy, age, or any other protected status set forth in federal, state, or local laws. This policy applies to all employment practices within our organization.</p><p>&nbsp;</p><p><b>PAY RANGE TRANSPARENCY</b></p><p>Procept is committed to fair and equitable compensation practices. The pay range(s) for this role represents a base salary range for non-commissionable roles or on-target earnings for commissionable roles. Actual compensation packages are based on several factors that are unique to each candidate, including but not limited to job-related skills, depth of experience, relevant certifications and training, and specific work location. Based on the factors above, Procept utilizes the full width of the range. The total compensation package for this position may also include eligibility for annual performance bonus, equity, and the benefits listed above.</p><p>&nbsp;</p><p><b>WORK ENVIRONMENT</b></p><p>Weâ\u0080\u0099ll provide you training for, and ask you to maintain trained status for, and comply with, all relevant aspects of the PROCEPT BioRobotics Quality Management System to ensure product and support regulatory compliance. We would also ask you to understand and adhere to the PROCEPT BioRobotics Quality &amp; EHS policies.</p><br/><br/>Please mention the word **TRUMP** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "requirements": [
      "system",
      "training",
      "support",
      "growth",
      "travel",
      "manager",
      "management",
      "marketing",
      "sales",
      "health",
      "healthcare",
      "executive"
    ],
    "salary_min": 45000,
    "salary_max": 72500,
    "job_type": "Full-time",
    "remote": true,
    "posted_date": "2025-08-19T20:00:13",
    "source": "RemoteOK",
    "url": "https://remoteOK.com/remote-jobs/remote-strategic-accounts-sales-representative-procept-biorobotics-1093872",
    "seniority_level": "Mid-level"
  },
  {
    "job_id": "remoteok_1093855",
    "title": "Job 23428 Senior Developer GenAI",
    "company": "CI&amp;T",
    "location": "Remote",
    "description": "<p><span style=\"font-size: 16px\">Somos especialistas em <b>transformaÃ§Ã£o tecnolÃ³gica</b>, unindo expertise [COMPANY] Ã  IA para criar soluÃ§Ãµes tech escalÃ¡veis. Com mais de </span><a href=\"http://6.500\"><span style=\"font-size: 16px\">7</span></a>.400<span style=\"font-size: 16px\"> CI&amp;Ters ao redor do mundo, jÃ¡ formamos parcerias com mais de </span><a href=\"http://1.000\"><span style=\"font-size: 16px\">1.000</span></a><span style=\"font-size: 16px\"> clientes durante nossos 30 anos de histÃ³ria. InteligÃªncia Artificial Ã© nossa realidade.</span></p><p><br></p><p><span style=\"font-size: 16px\"><b>Importante</b>: </span><span style=\"font-size: 16px;\">se vocÃª reside na RegiÃ£o Metropolitana de Campinas, sua presenÃ§a nos escritÃ³rios da cidade serÃ¡ obrigatÃ³ria, conforme a polÃ­tica de frequencia vigente.</span></p><p><br></p><p><b>Responsabilidades:</b></p><p>Atuar na execuÃ§Ã£o de provas de conceito e na construÃ§Ã£o de soluÃ§Ãµes inovadoras utilizando ferramentas de IA na plataforma AWS.</p><p><br></p><p><b>Requisitos para este desafio:</b></p><p>Conhecimento e experiÃªncia em GenAI, incluindo modelos de linguagem (LLMs), prompt engineering, context engineering, arquitetura RAG, banco de dados vetorial e agentes.&nbsp;</p><p>ExperiÃªncia em Python.</p><p>ExperiÃªncia em desenvolver em ambientes de nuvem.</p><p>Habilidade em trabalhar com dados em diferentes formatos e aplicar prÃ©-processamento conforme necessÃ¡rio.</p><p>Capacidade de trabalhar de forma autÃ´noma e de buscar soluÃ§Ãµes criativas.</p><p>Perfil explorador e interessado em aprender mais sobre IA, sempre se atualizando com as tendÃªncias em IA, novas ferramentas e prÃ¡ticas recomendadas.</p><p>Conhecimentos em Docker para criaÃ§Ã£o de ambientes isolados e reprodutÃ­veis.</p><p>AutomaÃ§Ã£o de fluxos de desenvolvimento e deploy com boas prÃ¡ticas de CI/CD.</p><p><br></p><p><b>Diferenciais:</b></p><p>Desenvolvimento de aplicaÃ§Ãµes backend.</p><p>ExperiÃªncia nos serviÃ§os AWS, incluindo Amazon Bedrock.</p><p>Conhecimento em frameworks de mercado: Langgraph, Strands Agents.</p><p><br></p><p><br></p><p><br></p><p>#LI-APS1</p><p>SÃ\u008aNIOR</p><p><br></p>\\n<p></p><p><br></p><p></p>\\n<p><span style=\"font-size: 16px\"><b>Nossos benefÃ­cios:</b></span></p><p><br></p><p><span style=\"font-size: 12pt\">- Plano de saÃºde e odontolÃ³gico;</span></p><p><span style=\"font-size: 12pt\">- Vale alimentaÃ§Ã£o e refeiÃ§Ã£o;</span></p><p><span style=\"font-size: 12pt\">- AuxÃ­lio-creche;</span></p><p><span style=\"font-size: 12pt\">- LicenÃ§a parental estendida;</span></p><p><span style=\"font-size: 12pt\">- Parceria com academias e profissionais de saÃºde e bem-estar via Wellhub (Gympass)&nbsp; TotalPass;</span></p><p><span style=\"font-size: 12pt\">- ParticipaÃ§Ã£o nos Lucros e Resultados (PLR);</span></p><p><span style=\"font-size: 12pt\">- Seguro de Vida;</span></p><p><span style=\"font-size: 12pt\">- Plataforma de aprendizagem contÃ­nua (CI&amp;T University);</span></p><p><span style=\"font-size: 12pt\">- Clube de descontos;</span></p><p><span style=\"font-size: 12pt\">- Plataforma online gratuita dedicada Ã  promoÃ§Ã£o da saÃºde fÃ­sica, mental e bem-estar;</span></p><p><span style=\"font-size: 12pt\">- Curso gestante e parentalidade responsÃ¡vel;</span></p><p><span style=\"font-size: 12pt\">- Parceria com plataformas de cursos online;</span></p><p><span style=\"font-size: 12pt\">- Plataforma para aprendizagem de idiomas;</span></p><p><span style=\"font-size: 12pt\">- E muitos outros</span></p><p><br></p><p><span style=\"font-size: 16px\">Mais detalhes sobre os nossos benefÃ­cios aqui: </span><a href=\"https://ciandt.com/br/pt-br/carreiras\"><span style=\"font-size: 16px\">https://ciandt.com/br/pt-br/carreiras</span></a></p><p><br></p><p><span style=\"font-size: 12pt\">Na CI&amp;T, a inclusÃ£o comeÃ§a no primeiro contato. Se vocÃª Ã© pessoa com deficiÃªncia, Ã© importante </span><b style=\"font-size: 12pt\">apresentar o seu laudo durante o processo seletivo.</b><span style=\"font-size: 12pt\"> Assim, podemos garantir o suporte e as adaptaÃ§Ãµes que vocÃª merece. </span><b style=\"font-size: 12pt\">Se ainda nÃ£o tem o laudo caracterizador, nÃ£o se preocupe: podemos te apoiar para obtÃª-lo.</b></p><p><br></p><p><span style=\"font-size: 12pt\">Temos um time dedicado de SaÃºde e Bem-estar, especialistas em inclusÃ£o e grupos de afinidade que estarÃ£o com vocÃª em todas as etapas. Conte com a gente para fazer essa jornada lado a lado.</span></p><br/><br/>Please mention the word **CONTINUITY** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "requirements": [
      "developer",
      "amazon",
      "docker",
      "senior",
      "digital nomad"
    ],
    "salary_min": 70000,
    "salary_max": 170000,
    "job_type": "Full-time",
    "remote": true,
    "posted_date": "2025-08-18T20:01:23",
    "source": "RemoteOK",
    "url": "https://remoteOK.com/remote-jobs/remote-job-23428-senior-developer-genai-ciampt-1093855",
    "seniority_level": "Senior"
  },
  {
    "job_id": "remoteok_1093849",
    "title": "Senior AI Engineer",
    "company": "Catalant",
    "location": "Remote",
    "description": "<p><span style=\"font-size: 11pt\">As the pioneer of Consulting 2.0, Catalant gives the worldâ\u0080\u0099s leading companies on-demand access to a community of highly vetted independent consultants and former operators. From individual consultants to full project teams, we deliver the right expertise to solve our clientsâ\u0080\u0099 most important challenges. Our clients include more than 30% of the Fortune 500, top private equity firms, and global consultancies, all seeking a more flexible, cost-effective way to get high-impact work done.</span></p><p><br></p><p><span style=\"font-size: 11pt\">Weâ\u0080\u0099ve reimagined consulting for todayâ\u0080\u0099s world: itâ\u0080\u0099s digitally enabled, fit-for-purpose, and designed to deliver outcomes, not just hours. Our proprietary platform powers our ability to connect companies with Catalant Experts and Teams whoâ\u0080\u0099ve solved similar problems before. Backed by world-class venture investors, weâ\u0080\u0099re building the team that will take Catalant and the future of consulting to the next level.</span></p><p><br></p><p><br></p><p><span style=\"font-size: 16px;\">We're looking for an </span><b style=\"font-size: 16px;\">AI Engineer</b><span style=\"font-size: 16px;\"> to drive innovation across our platform and within our business. Youâ\u0080\u0099ll build AI-powered capabilities that provide industry-leading user experiences and help our clients and expert community achieve results faster, while also enabling Catalantâ\u0080\u0099s internal team to work smarter and hit our growth targets. </span></p>\\n<p></p><p><br></p><b>What you'll do</b><ul><li><b>Help drive adoption of AI on the Catalant platform</b> and within our business, including:</li><li><i>AI Feature Development</i>: Build and deploy enterprise-ready, AI-driven features that harness Catalantâ\u0080\u0099s rich data to optimize our technology platform and internal workflows.</li><li><i>Building GenAI Systems With Cutting-Edge Design Patterns</i>: Create and maintain systems that use technologies like advanced RAG, agents, and others to provide precise, contextually relevant information across our technology platform and internal processes.</li><li><i>Data Infrastructure</i>: Team with data engineering to help ensure Catalantâ\u0080\u0099s AI-focused data infrastructure is properly evolving, integrating multiple data sources into a robust, highly optimized data warehouse tailored specifically for AI applications.</li></ul><div><br></div><ul><li><b>Technical ownership over AI project lifecycles</b> - own the projects you work on from planning to execution, with a team of friendly and helpful engineers that will provide assistance and feedback along the way.</li></ul><div><br></div><ul><li><b>Work cross-functionally</b> by partnering with product, design, data analytics, business systems, etc. to plan and gather requirements for projects.</li></ul><div><br></div><ul><li><b>Deliver new product features to our clients</b> quickly with a focus on accuracy, quality, usability, performance, and scalability</li></ul><p><br></p><b>What you'll bring</b><ul><li>At least 8-years of professional software engineering&nbsp; experience, including 4+ years focused on generative AI&nbsp;and ML systems.</li><li>Hands-on experience bringing AI solutions to production in an enterprise setting (i.e., you donâ\u0080\u0099t just write code in notebooks)</li><li>Integrating LLM APIs into responsive, real-time applications</li><li>Hands on, professional experience with common genAI design patterns, such as RAG, agentic systems, evals,&nbsp; model fine-tuning</li><li>Familiarity with a variety of genAI models and frameworks</li><li>Familiar with basic AI/ML concepts such as collection and utilization of testing/training data, validation and testing; basic ML algorithms; and an understanding of how LLMs work</li><li>Grounding in data science fundamentals, such as regression analysis, cross-validation, and techniques to address overfitting and underfitting</li><li>Experience in the full lifecycle of enterprise AI projects, including evaluation, guardrails, and monitoring, and maintaining AI systems in production.&nbsp;</li><li>Experience in MLOps / deploying models locally with GPUs and packages such as pytorch is a plus</li><li>Ability to work with stakeholders to understand requirements, collecting and incorporating feedback during and after deployment</li><li>Knowledge of OOP language(s);&nbsp; Deep and demonstrated python fluency required.&nbsp;</li><li>Deep working knowledge of one or more gen AI frameworks (such as Langgraph, LlamaIndex, or others)</li><li>Experience working with relational and vector databases; MySQL and Databricks experience a plus.</li><li>Demonstrated experience staying up to date with industry developments&nbsp;</li><li>Excitement about coaching peers in a constructive and positive way and ability to lead technically while also working independently and showing initiative to make an impact</li><li>Strong partnership with company leadership, engineering peers, product, and design during requirement discovery and solutioning</li><li>Ability to work with urgency, a strong sense of curiosity, and demonstrated ability to learn new technologies.</li></ul><p><br></p><p></p>\\n<p><b style=\"font-size: 18px;\">About Catalant's Engineering Team:</b></p><p><br></p><p>We value collaboration and teamwork, and strive for pragmatic solutions. Weâ\u0080\u0099re a Python shop on the Flask framework.&nbsp; We use docker, MySQL , Elasticsearch, and some VueJS deployed in GCP.&nbsp; We leverage CI and CD. We utilize the&nbsp; scrum framework to develop new features and platform improvements for our clients.&nbsp; New engineers typically deploy their first production code in their first week on the job.&nbsp; If you get stuck on a problem, your team is right there to help get you moving again. We are excited to be adding an engineer to our team that can help us bring our application to the next level while solving some of the interesting challenges we are addressing.</p><p><br></p><p>Our team values diversity in experience and backgroundsâ\u0080\u0094we do our best work when we create space for different voices and perspectives. Whatever unique experiences or skill sets you bring, we look forward to learning from each other.</p><p><br></p><p><b>Benefits&nbsp;</b></p><p><br></p><p>At Catalant, we strive to offer a work environment where employees can bring however much of their full, authentic self as they desire. With this in mind, we are happy to offer our employees:&nbsp;</p><p>- Flexible paid time off</p><p>- 13 company holidays + a week off from Christmas through New Years</p><p>- Twelve weeks of paid parental leave regardless of how you choose to grow your family</p><p>- Generous health insurance coverage as well as optional vision and dental</p><p>- 401k to save for retirement</p><p>- Pre-tax commuter and flexible spending accounts</p><p>- A lifestyle spending account to be used towards cell phone, internet, commuting, and learning &amp; development&nbsp;</p><p>- Wellness stipend for your mental, emotional, or physical wellbeing needs and support</p><p>- Work from Home stipend</p><p><br></p><p><br></p><p><b>Equal Employment Opportunity Policy</b></p><p>Catalant is proud to be an equal opportunity workplace. Catalant makes employment decisions on the basis of merit and business objectives and does not discriminate against applicants or employees on the basis of age, race, color, religion, national origin, ancestry, gender (including gender nonconformity and status as a transgender individual), sexual orientation, pregnancy, marital status, military or veteran status, qualified physical or mental disability, genetic condition or predisposition, or any other status protected by law. All Catalant employees are prohibited from engaging in any form of discrimination.</p><p><br></p><p><br></p><p><i>We have a flexible hybrid work model, where employees local to our Boston headquarters come into our office on a flexible basis, and other employees are fully remote. We are hiring and conducting interviews and onboarding either virtually or in person if local to Boston, depending on what makes most sense based on the specific candidate and new hire. Talk to our People Team to learn more!</i></p><br/><br/>Please mention the word **LEADING** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "requirements": [
      "design",
      "vuejs",
      "python",
      "consulting",
      "software",
      "growth",
      "code",
      "scrum",
      "mysql",
      "lead",
      "senior",
      "health",
      "engineer",
      "engineering",
      "digital nomad"
    ],
    "salary_min": 60000,
    "salary_max": 150000,
    "job_type": "Full-time",
    "remote": true,
    "posted_date": "2025-08-18T20:00:09",
    "source": "RemoteOK",
    "url": "https://remoteOK.com/remote-jobs/remote-senior-ai-engineer-catalant-1093849",
    "seniority_level": "Senior"
  },
  {
    "job_id": "remoteok_1093838",
    "title": "Senior Cloud Services Software Engineer",
    "company": "2100 NVIDIA USA",
    "location": "Remote",
    "description": "Joining NVIDIA's DGX Cloud Team means contributing to the infrastructure that powers our innovative AI research. This team focuses on optimizing efficiency and resiliency of ML workloads, as well as developing scalable AI infrastructure tools and services. Our objective is to deliver a stable, scalable environment for AI researchers, providing them with the vital resources and scale to champion innovation. We are seeking a distributed software engineer to join our team! As a Senior engineer, you'll be instrumental in developing and optimizing AI infrastructure services to bring peak AI performance and high resiliency for DGX Cloud. Your expertise in cloud services software architecture that drives the full resilience stack that will deliver an AI platform that redefines what is possible. This is an exceptional opportunity to push the boundaries of technology and shape the future of AI and the Cloud, and work with a world-class team of like-minded engineers. What You Will Be Doing: As a software engineer specializing in backend development, you'll work in a dedicated team to enhance the infrastructure and products that underpin NVIDIA's AI platforms. Your work will be essential in enabling innovative AI research, focusing on: Developing solutions at the intersection of machine learning, distributed systems, and high-performance computing, supplying to the advancement of AI technologies. Designing, developing, and optimizing (micro-)services orchestrated by Kubernetes to provide large-scale AI training workflows on AI training supercomputers located at major CSPs, with resiliency and efficiency. Co-designing and implementing the APIs that allow these services to integrate vertically with NVIDIA's resiliency stacks, ranging from tier-0 telemetry services to break/fix automation services to checkpoint and execution systems. Crafting a submission abstraction that enables model engineers and training platforms/frameworks to seamlessly submit long-running training jobs while hiding the complexity of handling infrastructure failures, running job lifecycles with auto-restarts on failure, ensuring full efficiency, and promptly advising users. Crafting these services to be modular, enabling them to be coordinated with and deployed onto on-premises AI clusters that apply NVIDIA Hardware and Cloud services. What We Need To See: A Bachelor's degree or higher in Computer Science or a related technical field (or equivalent experience). 5+ years of hands-on experience in backend development, preferably with Python, Go, C/C++, or similar high-performance languages. Consistent track record of building and scaling large-scale distributed systems. Experience with cloud computing platforms such as AWS, Azure, and GCP, as well as container technologies like Docker and Kubernetes, and HPC/AI platforms such as Slurm. Ways to stand out from the crowd: Real world experience in DL frameworks, orchestrators like PyTorch, TensorFlow, JAX, and Ray Experience in developing a framework plugin architecture that allows the framework to be integrated with the cluster scheduler visibly to the users Strong understanding of NVIDIA GPUs, network technologies, and their failure patterns. Experience with AI models and AI based tools. Provide references to your code contributions. NVIDIA leads the way in groundbreaking developments in Artificial Intelligence, High-Performance Computing, and Visualization. The GPU, our invention, serves as the visual cortex of modern computers and is at the heart of our products and services. Our work opens up new universes to explore, enables amazing creativity and discovery, and powers what were once science fiction inventions, from artificial intelligence to autonomous cars. NVIDIA is looking for exceptional people like you to help us accelerate the next wave of artificial intelligence! Your base salary will be determined based on your location, experience, and the pay of employees in similar positions. The base salary range is 184,000 USD - 287,500 USD for Level 4, and 224,000 USD - 356,500 USD for Level 5. You will also be eligible for equity and benefits. Applications for this job will be accepted at least until August 10, 2025. NVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law. NVIDIA is the world leader in accelerated computing. NVIDIA pioneered accelerated computing to tackle challenges no one else can solve. Our work in AI and digital twins is transforming the world's largest industries and profoundly impacting society. Learn more about NVIDIA.<br/><br/>Please mention the word **GLIMMERING** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "requirements": [
      "software",
      "training",
      "docker",
      "technical",
      "code",
      "cloud",
      "leader",
      "senior",
      "engineer",
      "backend"
    ],
    "salary_min": 65000,
    "salary_max": 160000,
    "job_type": "Full-time",
    "remote": true,
    "posted_date": "2025-08-17T12:00:03",
    "source": "RemoteOK",
    "url": "https://remoteOK.com/remote-jobs/remote-senior-cloud-services-software-engineer-2100-nvidia-usa-1093838",
    "seniority_level": "Senior"
  },
  {
    "job_id": "remoteok_1093837",
    "title": "Technical Support Specialist",
    "company": "Insider.",
    "location": "Remote",
    "description": "<p>Before jumping in on all the information about the role and what you can bring to the table, let us introduce ourselves real quick.</p><p><br></p><p><b>About us</b></p><p><br></p><p>We are Insider, a B2B SaaS company that drives growth for its clients around the world. How are we achieving this? We are the #1 AI-native platform for Customer Experience and Marketingâ\u0080\u0094offers marketers a single platform to deliver unique experiences per person, drive profitable growth, and unleash peak productivity and efficiency. Our platform connects data across channels, predicts future behavior with AI, and individualizes experiences from a single platform.</p><p><br></p><p>We have just celebrated our&nbsp;<b>$500M Series E</b>&nbsp;funding round, led by&nbsp;<b>General Atlantic</b>. Before this, weâ\u0080\u0099ve unlocked unicorn status following our&nbsp;<b>Series D</b>&nbsp;round. We are backed by top-notch investors, including&nbsp;<b>Sequoia Capital, QIA, Riverwood,&nbsp;</b>and&nbsp;<b>Endeavor Catalyst</b>, and trusted by 1200+ brands from high-growth startups to the most prestigious Fortune 500 companies such as Samsung, Coca-Cola, Nike, Lâ\u0080\u0099Oreal, Singapore Airlines, Virgin, Nestle, Nissan, Lenovo, Puma, IKEA, Allianz, Dominos, CNN, and the list goes on.</p><p><br></p><p>Having unlocked unicorn status, Insider was congratulated for becoming one of the only&nbsp;<b>woman-founded, women-led</b>&nbsp;<b>B2B SaaS unicorns</b>&nbsp;in the world, to achieve $200M in CARR (Committed Annual Recurring Revenue). Insider was named a leader in The Forrester Wave for Cross-Channel Campaign Management 2021, and Leader in the IDC MarketScape: Worldwide Omnichannel Marketing Platforms for B2C Enterprises 2023 Assessment. The company has been recognized in&nbsp;<b>The Top 1% of all software companies worldwide in G2â\u0080\u0099s 2024 Software Awards</b>, and&nbsp;<b>named in The Top 10 Best Software Products with the most #1 rankings alongside other software legends like Google, Zoom, and&nbsp;<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://monday.com/\">Monday.com</a></b>. According to G2â\u0080\u0099s Springâ\u0080\u009924 reports. Insider is also the&nbsp;<b>#1 G2 Leader in 6+ categories</b>, including Customer Data Platforms (CDP), Personalization Engines, Personalization Software, Mobile Marketing, Customer Journey Analytics, and e-commerce Personalization.</p><p><br></p><p>When our team founded Insider, they not only sought to create a product company but also to build the most socially progressive technology community in the world. Through our corporate social responsibility initiatives like 100Projects SheCodes, SheLeads, and SheMarkables, our community has committed to scaling its impact into our communities across 27+ countries, spearheading transformative projects in areas such as health, education, farming, animal rights, and increasing the proportional representation of women in STEM careers.&nbsp;</p><p><br></p><p>Behind all these achievements, there is an exceptionally talented and passionate team across 27+ countries that moves fast and agile, creates cutting-edge products, and focuses on making an impact. If you want to join us on this journey, just keep reading.</p><p><br></p><p><span style=\"font-size: 14.6667px;\">Our Partner Success Team consists of people from 31 different nationalities. They are how we thrive. They are our story makers. They are quick learners &amp; problem solvers. They are the master problem solvers, they resolve, they care and they ignite. Each of them is part of harmonious teamwork that follows meaningful goals. They are creative and innovative when it comes to implementing best practices, they are strategists and methodological approachers, have their eyes set to converge on the ultimate goal that is the customersâ\u0080\u0099 success in all of the 25 regions. They are top-notch when it comes to forming relationships and stakeholder management. They are the perfect combination of people-driven and data-driven as they thrive on analytical thinking, analysis, and collaboration simultaneously. They are constant impact makers, constant developers, always eager to climb the steps of their career in this ever-growing multinational environment. We were a company made of 6 tiny desks when we started, so we never forget how important our hard work and dedication are. Until now it has been an inspiring story on our side, so we wanted to let you in on it. The rest? The rest is just this paragraph minimized into some bullet points on what we offer &amp; what we expect. But thatâ\u0080\u0099s the thing that makes the difference between storytellers &amp; story makers; the things that grab your soul.</span></p>\\n<p></p><p><br></p><b>As a Technical Support Specialist in Insider day in and day out you will;</b><ul><li>play a crucial role in the Customer Success Team that owns technical relationships with our partners using our products and services,</li><li>become an excellent communicator while mastering problem-solving skills,</li><li>work in coordination with the Customer Success Managers and be primarily responsible for supporting seamless experience for our partners,</li><li>troubleshoot technical issues, find resolutions for partner requests, review partner queries, and find creative solutions that streamline their requirements and leverage knowledge to help partners get over technical struggles while expanding to the Insider platform,</li><li>contribute to building innovative products by advocating for partners by taking their feedback and sharing it with the Product team to improve processes and product offerings,</li><li>meet important SLAs like response time and the lead time for issue resolutions which is an important aspect.</li></ul><p><br></p><b>We want you to join us while we are taking a step into the future if you;</b><ul><li>have a Bachelorâ\u0080\u0099s Degree with Information Management, IT &amp; Computer Science, Programming, or Engineering&nbsp;related fields,&nbsp;</li><li>have fluency in written and verbal&nbsp;<b>English</b></li><li>have a high sense of responsibility and accountability,</li><li>have<b> strong analytical and problem-solving skills.</b></li><li>are able to provide timely responses and follow up systematically,</li><li>with effective communication and collaboration skills.</li><li>have <b>ability to learn quickly and work effectively in a team-oriented environment.</b></li><li>have good debugging/troubleshooting skills,</li><li>know your way around HTML, CSS, or other programming languages, would be a plus.</li></ul><p><br></p><b>While we are conquering the world, we are offering you;</b><ul><li>A chance to work in an&nbsp;<b>international, diverse, and inclusive environment,</b></li><li><b>\"Tech Talks\"&nbsp;</b>with famous and groundbreaking people from the software world,</li><li>To be part of an industry thatâ\u0080\u0099s&nbsp;<b>shaping the future of customer experiences.</b>&nbsp;Don't believe us? Just ask Google,</li><li>Access and opportunity to gain a<b>&nbsp;limitless network all over the globe,</b></li><li>Access to many&nbsp;<b>hard and soft skills pieces of training</b>&nbsp;to help you improve and challenge yourself,</li><li>access to 16,000+ online courses taught by real-world professionals on the&nbsp;<b>LinkedIn Learning</b>&nbsp;platform to satisfy your hunger for knowledge,</li><li>A space to share your skills through training sessions and workshops if you wish. Sharing is caring!</li><li>Inclusive Private Health Insurance,</li><li>The team activities that are bursting with fun,</li><li>No Dress Code! This is a fast and innovative startup, you can wear whatever you want.</li></ul><p><br></p><b>And in Taipei Office, we are offering you:</b><ul><li>Competitive Salary + Commission</li><li>Hybrid working Model</li><li>Personal Notebook</li><li>Afternoon Tea offered on every Friday afternoon</li><li>Labor insurance &amp; National Health Insurance</li><li>Labor Pension</li><li>15 days of annual leave plus national holidays in Taiwan</li></ul><div><br></div><p><br></p><p></p>\\n<p><b>Department&nbsp;</b>Customer Success</p><p><b>Locations&nbsp;</b>Taipei , Taiwan</p><p><b>Remote status&nbsp;</b>Hybrid</p><p><b>Employment type </b>Full-time</p><p><br></p><p>We provide equal opportunity in a zero-discrimination workplace and not just welcome but also embrace everyone without regard to sex, race, color, nationality, religion, gender identity, sexual orientation, disability status, citizenship, or marital status.</p><br/><br/>Please mention the word **STIMULATIVE** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "requirements": [
      "saas",
      "training",
      "technical",
      "support",
      "software",
      "growth",
      "mobile",
      "leader",
      "management",
      "lead",
      "marketing",
      "health",
      "e-commerce"
    ],
    "salary_min": 50000,
    "salary_max": 70000,
    "job_type": "Full-time",
    "remote": true,
    "posted_date": "2025-08-17T04:00:05",
    "source": "RemoteOK",
    "url": "https://remoteOK.com/remote-jobs/remote-technical-support-specialist-insider-1093837",
    "seniority_level": "Mid-level"
  },
  {
    "job_id": "remoteok_1093836",
    "title": "AI Prompt Engineer",
    "company": "ActiveCampaign",
    "location": "Remote",
    "description": "<p><span style=\"font-size: 11pt;\">We are hiring an AI Prompt Engineer to scale how teams across the company adopt and integrate AI into their day-to-day work. This is a hands-on role focused on prompt design, workflow implementation, and knowledge asset creation, with a goal of delivering repeatable, high-quality interactions across internal AI tools.</span></p><p><span style=\"font-size: 11pt;\">Youâ\u0080\u0099ll play a key role in building and maintaining a centralized prompt library that powers AI workflows across the business, ensuring each prompt is clear, reliable, and aligned with internal standards. This work sits at the core of our broader AI strategy, reducing manual, repetitive work, improving team efficiency and delivering faster, more consistent experiences throughout the customer journey.</span></p>\\n<p></p><p><br></p><b>What your day could consist of: </b><ul><li>Design and implement AI-powered workflows that drive measurable business outcomes in collaboration with internal teams.</li><li>Build and maintain high-quality, reusable prompts in a centralized prompt library.</li><li>Iterate on prompts to enhance clarity, consistency, and automation logic.</li><li>Troubleshoot and resolve issues related to prompt execution or system integration.</li><li>Use tools like Zapier and APIs to connect systems and streamline workflows.</li><li>Review prompt output quality across key use cases for accuracy and usefulness.</li><li>Collaborate with Operations and Quality teams to scale review and feedback processes.</li><li>Improve the accessibility and structure of internal knowledge content used by AI systems.</li><li>Align with stakeholders across Ops, Enablement, and leadership on priorities and rollout.</li><li>Translate feedback into actionable prompt or workflow improvements.</li><li>Monitor prompt and workflow performance to identify improvement opportunities.</li><li>Generate insights from usage data to inform decisions and share best practices.</li></ul><p><br></p><b>What is needed:</b><ul><li>Strong practical understanding of LLMs and core AI concepts (e.g. prompt engineering, RAG, function calling) and how they can be applied across an organization's internal operations.</li><li>Experience in operations or AI-enabled roles with a strong focus on building automations that drive meaningful outcomes ideally where you leveraged AI to improve processes or outcomes.</li><li>Familiarity with workflow tools like Zapier, APIs, or internal scripting frameworks to build lightweight AI integrations.</li><li>Strong background in building or maintaining workflows that connect tools, reduce manual work, or improve user experience.</li><li>A bias for action, you enjoy moving from idea to implementation and thrive in environments where experimentation and iteration lead to meaningful impact.</li><li>Great problem-solving skills with an ability to identify, diagnose and resolve technical issues in AI-powered systems.</li><li>Ability to analyze data and surface insights that drive continuous improvement.</li><li>Strong communication and collaboration skills, adept at working cross-functionally with internal teams and external vendors to achieve shared goals.</li><li>Agility in adapting to new technologies, shifting priorities, and evolving business needs.</li></ul><p><br></p><p></p>\\n<div>$72,800 - $100,100 a year</div>\\n<p><b>About ActiveCampaign:</b></p><p>ActiveCampaign is an AI-first, end-to-end marketing platform for people at the heart of the action. It empowers teams to automate their campaigns with AI agents that imagine, activate, and validateâ\u0080\u0093freeing them from step-by-step workflows and unlocking limitless ways to orchestrate their marketing.</p><p><br></p><p>With AI, goal-based automation, and 950+ app integrations, agencies, marketers, and owners can build cross-channel campaigns in minutesâ\u0080\u0093fine-tuned with billions of data points to drive real results for their unique business.</p><p><br></p><p>ActiveCampaign is the trusted choice to help businesses unlock a new world of boundless opportunitiesâ\u0080\u0093where ideas become impact and potential turns into real results.</p><p><br></p><p>As a global multicultural company, we are proud of our inclusive culture which embraces diverse voices, backgrounds, and perspectives. We donâ\u0080\u0099t just celebrate our differences, we believe our diversity is what empowers our innovation and success. You can find out more about our DEI initiatives <a href=\"https://www.activecampaign.com/about/diversity-equity-inclusion\">here</a>.&nbsp;</p><p><br></p><p><b>Perks and benefits:</b></p><p>At ActiveCampaign, we prioritize employeesâ\u0080\u0099 well-being and professional growth by cultivating a culture centered on collaboration and innovation. When you join our team, youâ\u0080\u0099ll not only have the opportunity to make a significant impact, but also enjoy a range of benefits tailored to support your personal and career development.&nbsp;</p><p><br></p><p><b>Here are some of the benefits we offer:</b></p><p><b>-Comprehensive Health &amp; Wellness:</b> Top-tier benefits package that includes a fully-covered High Deductible Health Plan (HDHP), complimentary access to telehealth services, and a free subscription to Calm.</p><p><b>-Growth &amp; Development:</b> Access to LinkedIn Learning, professional development programs, and career growth opportunities in a fast-growing organization.</p><p><b>-Generous Paid Time Off: </b>Recharge and take the time you need to maintain work-life balance with open PTO.&nbsp;</p><p><b>-Total Rewards:</b> Generous 401(k) matching with immediate vesting, quarterly perks with commuter and lunch benefits for hub based employees or a stipend for remote workers, and a four-week paid sabbatical with bonus after five years.</p><p><b>-Collaborative Culture: </b>Work alongside brilliant, passionate colleagues in an environment that values innovation, teamwork, and mutual support.</p><p><br></p><p>ActiveCampaign is an equal opportunity employer. We recruit, hire, pay, grow and promote no matter of gender, race, color, sexual orientation, religion, age, protected veteran status, physical and mental abilities, or any other identities protected by law. </p><p><br></p><p>Our Employee Resource Groups (ERGs) strive to foster a diverse inclusive environment by supporting each other, building a strong sense of belonging, and creating opportunities for mentorship and professional growth for their members.</p><br/><br/>Please mention the word **FORTUITOUS** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "requirements": [
      "system",
      "technical",
      "support",
      "growth",
      "lead",
      "content",
      "operations",
      "marketing",
      "health",
      "engineer"
    ],
    "salary_min": 52500,
    "salary_max": 110000,
    "job_type": "Full-time",
    "remote": true,
    "posted_date": "2025-08-17T04:00:02",
    "source": "RemoteOK",
    "url": "https://remoteOK.com/remote-jobs/remote-ai-prompt-engineer-activecampaign-1093836",
    "seniority_level": "Mid-level"
  },
  {
    "job_id": "remoteok_1093833",
    "title": "Blockchain Developer",
    "company": "Coin Market Cap Ltd",
    "location": "Remote",
    "description": "<p><b style=\"font-size: 12pt;\">Responsibilities:</b></p><p><span style=\"font-size: 12pt;\">1. Develop, test, and deploy smart contracts on the Solana blockchain platform.</span></p><p><span style=\"font-size: 12pt;\">2. Design and implement the backend logic of decentralized applications (dApps), ensuring the efficiency, security, and scalability of the code.</span></p><p><span style=\"font-size: 12pt;\">3. Collaborate with the front-end development team to integrate the front-end and back-end of dApps.</span></p><p><span style=\"font-size: 12pt;\">4. Keep up with the latest developments in Solana blockchain technology and optimize existing system architecture.</span></p><p><span style=\"font-size: 12pt;\">5. Participate in the planning, design, and implementation of blockchain projects, providing technical solutions.</span></p><p><span style=\"font-size: 12pt;\">6. Solve technical challenges encountered during the development process to ensure timely project delivery.</span></p><p><br></p><p><span style=\"font-size: 12pt;\">Requirements:</span></p><p><span style=\"font-size: 12pt;\">1. Bachelor's degree or above in Computer Science, Software Engineering, or a related field.</span></p><p><span style=\"font-size: 12pt;\">2. Proficient in Rust programming language with a solid foundation in programming and good coding practices.</span></p><p><span style=\"font-size: 12pt;\">3. Familiar with the architecture of the Solana blockchain platform, the smart contract development process, and tools.</span></p><p><span style=\"font-size: 12pt;\">4. Understand the basic principles of blockchain, including consensus mechanisms and distributed ledgers.</span></p><p><span style=\"font-size: 12pt;\">5. Possess strong problem-solving skills and a team-oriented mindset.6. Prior experience in Solana project development is preferred.</span></p><p><span style=\"font-size: 12pt;\">7. Familiarity with </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 12pt;\" href=\"http://Web3.js\">Web3.js</a><span style=\"font-size: 12pt;\"> or other blockchain development frameworks is a plus.</span></p><p><span style=\"font-size: 12pt;\">8. Good command of English reading and writing skills to read and understand technical documents in English.</span></p>\\n<p></p><p><br></p><p></p>\\n<br/><br/>Please mention the word **LIBERATE** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "requirements": [
      "developer",
      "design",
      "system",
      "front-end",
      "back-end",
      "technical",
      "software",
      "backend",
      "digital nomad"
    ],
    "salary_min": 60000,
    "salary_max": 125000,
    "job_type": "Full-time",
    "remote": true,
    "posted_date": "2025-08-16T19:00:02",
    "source": "RemoteOK",
    "url": "https://remoteOK.com/remote-jobs/remote-blockchain-developer-coin-market-cap-ltd-1093833",
    "seniority_level": "Mid-level"
  },
  {
    "job_id": "remoteok_1093829",
    "title": "Crypto Community Manager",
    "company": "Stronghold",
    "location": "Remote",
    "description": "<p style=\"min-height:1.5em\">Stronghold is a fintech infrastructure company reimagining how money movesâ\u0080\u0094securely, transparently, and with next-gen compliance at its core. We provide developer-friendly APIs that power fast, secure pay-by-bank and embedded payments. Our SHx token brings a new layer of utility to our ecosystem, supporting merchant rewards, governance, and decentralized financing.</p><p style=\"min-height:1.5em\">We're also an AI-forward company. At Stronghold, AI isn't a buzzwordâ\u0080\u0094it's foundational. We integrate AI tools and workflows into every department, from product development and engineering, to finance, marketing, compliance, and operations. AI accelerates our decision-making, enhances our customer experience, and enables every team member to operate at a higher level of efficiency and creativity.</p><p style=\"min-height:1.5em\">Headquartered in the San Francisco Bay Area with deep roots in New Zealand, we operate with a global mindset and local grit. Weâ\u0080\u0099re a diverse team of technologists, operators, and industry experts driven by curiosity and impact. At Stronghold, we value speed over red tape, substance over flash, and innovation without ego.</p><p style=\"min-height:1.5em\">Our core values: Be Self-Aware, Have Good Judgment, Be Curious, Seek Innovation, Communicate Clearly, Make a High Impact, Be Bold, Be Selfless, Be Accountable, Be Honest, and Show Grit. Be Self-Aware, Have Good Judgment, Be Curious, Seek Innovation, Communicate Clearly, Make a High Impact, Be Bold, Be Selfless, Be Accountable, Be Honest, and Show Grit.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the Company</strong></p><p style=\"min-height:1.5em\"><br /></p><p style=\"min-height:1.5em\">Named a Forbes Fintech 50, Strongholdâ\u0080\u0099s mission is to improve financial access by powering innovative payment and financial services solutions through our open APIs.Â  Weâ\u0080\u0099ve been going deep to lay the underlying rails for modern payments and reach all customers with secure, transparent ways to move money.Â We are seeking team players who can evolve with the company as we scale and add new products. We are a team of technologists and industry experts who take a data-driven and innovative approach to solving problems.Â  We power possibilities for our customers by bringing the best talent together in an open and collaborative work environment that rewards curiosity and grit.</p><p style=\"min-height:1.5em\"><br /></p><p style=\"min-height:1.5em\">Stronghold is proud of its SF Bay Area and New Zealand roots and strives to build a diverse team to serve our ecosystem better while staying true to our core values.Â  Our core values are to Be Self Aware, Have Good Judgment, Be Curious, Seek Innovation, Excellent Communication, High Impact, Be Bold, Be Selfless, Be Accountable, Be Honest, and Show Grit.</p><p style=\"min-height:1.5em\"><br /></p><p style=\"min-height:1.5em\"><strong>About the Role</strong></p><p style=\"min-height:1.5em\"><br /></p><p style=\"min-height:1.5em\">As the Community Manager for SHx, you will serve as the primary face and voice of our token community, focused on building meaningful relationships, developing long-term engagement strategies, and representing SHx at events and conferences. You will own the entire community function â\u0080\u0094 from planning activations to facilitating user feedback loops â\u0080\u0094 with the goal of strengthening the SHx ecosystem across Discord, Twitter/X, and Telegram.</p><p style=\"min-height:1.5em\"><br /></p><p style=\"min-height:1.5em\">This role reports to the CEO and collaborates closely with our Marketing Associate, Content Producer, and Product Marketing teammates.</p><p style=\"min-height:1.5em\"><br /></p><p></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What You'll Do</strong></p><p></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own and lead SHxâ\u0080\u0099s community strategy, growth, and engagement across key platforms.</p></li><li><p style=\"min-height:1.5em\">Respond to community inquiries and feedback with empathy and accuracy.</p></li><li><p style=\"min-height:1.5em\">Represent SHx at industry meetups, events, and conferences.</p></li><li><p style=\"min-height:1.5em\">Design and host virtual events like AMAs, webinars, and token updates.</p></li><li><p style=\"min-height:1.5em\">Work closely with marketing and product to surface community insights.</p></li><li><p style=\"min-height:1.5em\">Create updates and high-signal messaging tailored to SHx token holders and advocates.</p></li><li><p style=\"min-height:1.5em\">Track engagement, sentiment, and report on community health to leadership.</p></li><li><p style=\"min-height:1.5em\">Provide regular reports to leadership on community growth, engagement, and sentiment</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What We're Looking For</strong></p><p></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">7+ years of experience in community management or a similar role, preferably in blockchain, fintech, or tech startups.</p></li><li><p style=\"min-height:1.5em\">Demonstrated success in building and managing online communities.</p></li><li><p style=\"min-height:1.5em\">Exceptional written and verbal communication skills.</p></li><li><p style=\"min-height:1.5em\">Proficiency in social media platforms, community management tools, and analytics software.</p></li><li><p style=\"min-height:1.5em\">Strong organizational skills and ability to juggle multiple projects.</p></li><li><p style=\"min-height:1.5em\">Must be proficient in prompting AI tools like ChatGPT and/or Claude</p></li><li><p style=\"min-height:1.5em\">Familiarity with cryptocurrency, blockchain technology, and SHx is a strong plus. A deep understanding of online communities and the ability to navigate the complexities of community dynamics.</p></li><li><p style=\"min-height:1.5em\">Passion for building inclusive, engaged, and vibrant communities. A proactive, problem-solving approach with an ability to adapt to fast-changing environments. Must have the ability to remain professional and enthusiastic in the face of potential confrontation.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">As an equal opportunity employer, Stronghold does not discriminate against any applicant or employee based on race, color, sex, sexual orientation, gender identity, marital status, religion, national origin, ancestry, age, disability, military or veteran status, genetic information or any other basis protected by applicable federal, state, or local laws.</p><p style=\"min-height:1.5em\"><br /></p><p style=\"min-height:1.5em\">Authorized to work in the United States (required)</p><p style=\"min-height:1.5em\">No visa sponsorship available at this time</p><p></p><p style=\"min-height:1.5em\">As an equal opportunity employer, Stronghold does not discriminate against any applicant or employee based on race, color, sex, sexual orientation, gender identity, marital status, religion, national origin, ancestry, age, disability, military or veteran status, genetic information or any other basis protected by applicable federal, state, or local laws.</p><p style=\"min-height:1.5em\">Authorized to work in the United States (required)</p><p style=\"min-height:1.5em\">No visa sponsorship available at this time</p><br/><br/>Please mention the word **RECTIFICATION** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "requirements": [
      "crypto",
      "manager",
      "embedded",
      "ceo",
      "voice",
      "financial",
      "fintech",
      "rails",
      "management",
      "lead",
      "content",
      "marketing",
      "analytics",
      "health",
      "non tech"
    ],
    "salary_min": 35000,
    "salary_max": 70000,
    "job_type": "Full-time",
    "remote": true,
    "posted_date": "2025-08-15T20:00:05",
    "source": "RemoteOK",
    "url": "https://remoteOK.com/remote-jobs/remote-crypto-community-manager-stronghold-1093829",
    "seniority_level": "Management"
  },
  {
    "job_id": "remoteok_1093828",
    "title": "Senior Staff Ruby on Rails Engineer",
    "company": "Housecall Pro",
    "location": "Remote",
    "description": "<p><strong><em>TO BE CONSIDERED FOR THIS ROLE, PLEASE SUBMIT AN UPDATED RESUME TRANSLATED TO ENGLISH</em></strong></p><h1><strong>Who is Housecall Pro?Â Â </strong></h1><p>Housecall Pro is a fintech company founded in 2013. We built a SaaS platform that helps Home Service Professionals operate their businesses. We created the application for plumbers, electricians, and other Pros in the home improvement/trades industries.</p><p><em>Housecall Pro is a simple, cloud-based field service management software platform aimed at </em><strong><em>helping companies keep track of jobs, monitor technician activity, and produce invoices easily</em></strong><em>.</em></p><p>Our core product helps our clients with scheduling, dispatching, job management, invoicing, payment processing, marketing, and more. They used to struggle with the ton of paperwork after their hours. Now they can save time, and manage their business in one app.</p><p>We support more than 27,000 businesses and have over 1,300 ambitious, mission-driven employees in San Diego, Denver, and all over the world (including 200+ talented and innovative Engineers).</p><p><br /></p><p><strong>ð\u009f¤\u009cð\u009f¤\u009bÂ  WHATâ\u0080\u0099S IN IT FOR YOU?:</strong></p><ul><li><strong>ð\u009f\u0092»ð\u009f\u008c\u008eRemote environment </strong>totally built to make you feel that we are all together in one space without leaving your home office!</li><li><strong>ð\u009f\u0098\u008eð\u009f\u008f\u009dSelf Managed PTO</strong> - Beach? Mountains? Camping? Discovering new experiences? You are free to take time out as you need!</li><li><strong>â\u008f°Flexible work hours - </strong>We believe that you can reach your professional and personal goals working with us and encourage you to have a work life balance!</li><li>A culture built on <strong>innovation </strong>that values big ideas - We are always open to new ideas that will improve the life of our Pros!</li><li><strong>Work in your own time zone</strong> - Because we donâ\u0080\u0099t think that you should miss those memorable moments with your friends and family!</li><li><strong>Newest MacBook (or PC if you prefer!) + Setup Fee ($500</strong>)<strong> - </strong>What is an engineer without the right tools right? Here in HCP, you can choose your computer andÂ  set up your home office!</li></ul><p><br /></p><p><strong>We know what you are thinkingâ\u0080¦WHAT IS THE ROLE AND WHAT WILL YOU BE DOING? ð\u009f\u0091\u0080</strong></p><p>As a Senior Staff Software Engineer, you are a critical individual contributor and architectural leader within our engineering organization. You drive the long-term technical vision of our platform, guiding how we design, build, and evolve scalable, reliable systems across multiple squads. As a high-impact, high-autonomy technical leader, you combine deep technical contributions with influential cross-team collaboration, helping shape the future of our platform to better serve our customers.</p><p>You serve as a trusted technical partner to Engineering Managers, Directors, and Product leadership, taking ownership of our most complex technical challenges while mentoring engineers across the organization. You play a pivotal role in our transition from a monolithic Ruby on Rails application toward a modern, distributed, event-driven, domain-oriented architecture.</p><p>Our team is passionate, empathetic, hard working, and above all else focused on improving the lives of our service professionals (our Pros). Our success is their success.</p><p><br /></p><p><strong><em>In your daily routine, you will:Â </em></strong></p><ul><li>Lead cross-squad architecture efforts, shaping and evolving technical direction across multiple domains<br /><br /></li><li>Design and build scalable, fault-tolerant systems to ensure outstanding performance and reliability as our customer base grows<br /><br /></li><li>Champion Domain-Driven Design (DDD) practices and empower teams to structure software around clear, maintainable domain boundaries<br /><br /></li><li>Advocate for and guide the adoption of event-driven system design using tools such as Kafka and SQS<br /><br /></li><li>Educate and mentor engineers on architecture principles, design patterns, and best practices across the engineering organization<br /><br /></li><li>Identify and drive the resolution of technical bottlenecks and hotspots through refactoring and re-architecture efforts<br /><br /></li><li>Uphold and advance engineering excellence in areas such as performance optimization, secure coding, test automation, and CI/CD health<br /><br /></li><li>Conduct deep technical reviews of codebases and architectural designs to ensure long-term maintainability and scalability<br /><br /></li><li>Collaborate cross-functionally with Product, Design, and Site Reliability Engineering (SRE) teams to align technical solutions with business needs<br /><br /></li><li>Model a culture of ownership, accountability, and technical excellence across squads</li></ul><p><br /></p><ul><li>Help engineers leverage AI to boost productivity and solve complex product challenges through hands-on guidance and enablement.<br /><br /></li></ul><p><br /></p><p><strong>ð\u009f\u008f\u0086 You must be aware that joining Housecall Pro means:Â </strong></p><ul><li>Building a product that really improves usersâ\u0080\u0099 lives <strong>(70k users, 4.6 rates at App Store) </strong>- <a href=\"https://www.youtube.com/watch?v=aQ0Heukfbfo&amp;list=PLtOkEN3J3qWtwlaNnKV9RfawopkaYMu4B&amp;index=7\">letâ\u0080\u0099s see what clients say about the product;</a></li><li>Being a part of a global team that build a diverse culture in our company</li><li>Working with more than 200 engineers highly qualified and engaged in improving the life of our Pros.Â </li><li>Having a<strong> real impact on technical decisions</strong> without breaking through the corporate, glass ceiling;</li><li>Being in direct <strong>contact with the community of users</strong>, who are eager to share their feedback;</li><li>Rapidly growing teams that create a <strong>defined career path.</strong></li></ul><p><br /></p><p><strong>We think that this offer is for you if you have:</strong></p><ul><li>â\u009c\u00859+ years of experience designing, building, and operating complex production systems</li><li><strong>â\u009c\u0085 Deep experience in Ruby/RoR</strong></li><li>â\u009c\u0085Proficiency in multiple programming languages (i.e. JavaScript, Python, Go, Java, Node.js)</li><li>â\u009c\u0085Deep expertise with cloud platforms (i.e. AWS), containerization, and serverless/cloud-native architectures</li><li>â\u009c\u0085Proven success applying Domain-Driven Design (DDD) principles across multiple teams or domains</li><li>â\u009c\u0085Experience architecting and building event-driven systems using distributed messaging tools (i.e. Kafka, SQS)</li><li>â\u009c\u0085Experience with defining and improving CI/CD pipelines (e.g., Jenkins, Gitlab, etc) and automated testing strategies (e.g., e2e, canary tests, integration tests, etc)</li><li>â\u009c\u0085Expertise in scalable API design and management (i.e. RESTful APIs; GraphQL is a plus)</li><li>â\u009c\u0085Strong background in system observability practices (logs, metrics, tracing) and performance diagnostics</li><li>â\u009c\u0085Bachelorâ\u0080\u0099s degree in Computer Science, Engineering, or related field, or equivalent work experience</li></ul><p><br /></p><p>ð\u009f\u0094\u009dAnd also,<strong> you get extra points for:</strong></p><ul><li>â\u009c\u0094Â  Strong systems thinking with an ability to simplify complex problems</li><li>â\u009c\u0094Â  Comfort working through ambiguity and making well-reasoned decisions with incomplete information</li><li>â\u009c\u0094Â  Collaborative nature with a proactive approach to communicating technical trade-offs</li><li>â\u009c\u0094Â  Deep empathy for the end-user and a commitment to building solutions that deliver real value</li><li>â\u009c\u0094Â  Ownership mentality with a balance of urgency and long-term system health</li><li>â\u009c\u0094Â  Curiosity and passion for staying current on evolving architecture patterns and best practices</li><li>â\u009c\u0094 Demonstrate a strong passion for using AI technologies to enhance productivity, quality, and innovation</li><li>â\u009c\u0094 Curiosity and drive to stay ahead of emerging AI/ML technologies and their practical applications</li></ul><p><br /></p><p><strong>Okay, okay, you need something to pay the bills, right? ð\u009f¤\u0091</strong></p><p>Our range of compensation starts at: ð\u009f\u0092µ<strong>8000 USD dollars.ð\u009f\u0092µ</strong></p><p><br /></p><p><strong>Come and join us in HCP!</strong></p><p><em>Founded in 2013, Housecall Pro helps home service professionals (Pros) streamline every aspect of their business. With easy-to-use tools for scheduling, dispatching, payments, and more, Housecall Pro enables Pros to save time, grow profitably, and provide best-in-class service.</em></p><p><em>Housecall Proâ\u0080\u0099s brand portfolio includes Business Coaching by Housecall Pro, a business coaching solution for home services businesses. Our brands are united by a singular mission to champion our Pros to success.</em></p><p><em>We support more than 40,000 businesses and have over 1,800 ambitious, mission-driven, genuinely fun-loving teammates across the globe. If you want to do work that impacts real people, supported by a team that will invest in you every step of the way, weâ\u0080\u0099d love to hear from you</em></p><p><em>Housecall Pro celebrates diversity and we are committed to creating an inclusive environment.Â  We are an equal opportunity employer and do not discriminate on the basis of gender, race, religion, national origin, ethnicity, disability, gender identity/expression, sexual orientation, veteran or military status, or any other category protected under the law.</em></p><br/><br/>Please mention the word **CLARITY** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "requirements": [
      "dev",
      "ruby",
      "backend"
    ],
    "salary_min": 90000,
    "salary_max": 100000,
    "job_type": "Full-time",
    "remote": true,
    "posted_date": "2025-08-15T17:43:41",
    "source": "RemoteOK",
    "url": "https://remoteOK.com/remote-jobs/remote-senior-staff-ruby-on-rails-engineer-housecall-pro-1093828",
    "seniority_level": "Senior"
  },
  {
    "job_id": "remoteok_1093803",
    "title": "Public Training Associate",
    "company": "The Trevor Project",
    "location": "Remote",
    "description": "<p>About Trevor:</p><p><br></p><p>The Trevor Project is the leading suicide prevention and crisis intervention organization for LGBTQ+ young people. Trevor offers 24/7 crisis services, connecting highly trained counselors with LGBTQ+ young people whenever they need support. To drive prevention efforts, The Trevor Project also operates robust research, advocacy, education, and peer support programs. Weâ\u0080\u0099ve been saving lives every day for over 25 years.</p><p><br></p><p>Every day, and in every role, our staff contribute to our critical mission of ending suicide among lesbian, gay, bisexual, transgender, queer &amp; questioning young people by embodying our values:</p><p><br></p><p>Heartâ\u0080\u0093We care deeply and commit to do what matters</p><p>Integrityâ\u0080\u0093We build trust through our words and actions</p><p>Community-Together, we are an unstoppable force for good</p><p>Belonging-We serve as allies to the mission, and to each other</p><p>Progress-We continually move onward and upward</p><p><br></p><p><br></p><p><span style=\"font-size: 10pt\">Applicants and staff must be authorized to work for any employer in the United States.&nbsp; The Trevor Project will not sponsor an employment visa for this position.</span></p><p><br></p><p><br></p><p><b style=\"font-size: 16px;\">Role: Public Training Associate (Temporary)</b></p><p><b>Location:</b> This role will be remote in the continental United States</p><p><b>Reports to: </b>Public Training Senior Manager</p><p><b>Eligibility:</b>&nbsp; Authorization to work for any employer in the United States is required. The Trevor Project will not sponsor a work visa for this role.</p><p><b>Classification: </b>Nonexempt Full Time (Temporary - 9 months)</p><p><b>Union Role?&nbsp;</b> No (Temporary)</p><p><b>Salary Range:</b> $30/hr</p><p><br></p><p><b style=\"font-size: 18px;\">Summary:&nbsp;</b></p><p>This is a temporary role anticipated to last for 9 months. This role will&nbsp; support the delivery of training programs that advance Trevorâ\u0080\u0099s mission and public education efforts. This role assists in preparing for and facilitating virtual and in-person trainings, maintains and updates training materials, and supports operational tasks such as organizing inquiries and coordinating logistics. Working closely with teammates and cross-functional partners, the Associate applies a learnerâ\u0080\u0099s mindset, demonstrates attention to detail, and communicates proactively to support team goals. This is an ideal role for someone eager to grow their facilitation skills, contribute to impactful educational programming, and develop a deeper understanding of public training and LGBTQ+ advocacy work.</p><p><br></p>\\n<p></p><p><br></p><b>Roles and Responsibilities:</b><ul><li>Support updates to training materials by incorporating current best practices and new content</li><li>Help prepare training content, facilitator guides, scripts, and slide decks for public-facing presentations</li><li>Track incoming public training requests and support scheduling, organization, and documentation</li><li>Collect and input training data to support metric tracking and reporting</li><li>Collaborate with teammates and cross-functional partners to support training operations and consistency</li><li>Share ideas for improving training materials and delivery formats</li><li>Coordinate logistical needs for trainings, including travel planning and materials preparation</li><li>Support responses to partner inquiries via shared inboxes and other communication platforms</li><li>Demonstrate fair, ethical, and equitable business practices</li><li>Learn eagerly, share knowledge appropriately, and improve continuously</li><li>Demonstrate successful planning and problem-solving skills, including multitasking and working well within tight timelines</li><li>Work, communicate, and collaborate effectively with others</li><li>Demonstrate attention to detail and accuracy in all work</li><li>Demonstrate a commitment to fostering and maintaining an environment of belonging&nbsp;</li><li>Other relevant duties and responsibilities as assigned</li></ul><p><br></p><b>Minimum Qualifications:</b><ul><li>1+ year of experience in facilitating engaging workshops, role-plays, and other interactive training activities - may be in professional, volunteer, academic, or community based settings</li><li>&nbsp;Demonstrated knowledge and understanding of LGBTQ+ issues, including the unique challenges faced by LGBTQ+ youth</li><li>Familiarity with crisis management protocols</li><li>Demonstrated ability to train a variety of learners with different learning styles, applying skills in training specifically for Crisis Services</li><li>Demonstrated commitment to staff wellness, with a trauma-informed approach, recognizing and addressing the unique challenges and stressors that volunteers face in crisis intervention work</li><li>A quiet, private work environment with high-speed dedicated broadband internet access (minimum 10Mb down/5Mb up)</li><li>Proficiency in:&nbsp;</li></ul><div>\t\t\t- Public speaking and facilitation&nbsp;</div><div>\t\t\t- Proficiency in spoken and written English</div><p><br></p><p></p>\\n<div>$30 - $30 an hour</div>\\n<p><b>Why Trevor?</b></p><p>A career that truly makes a difference in the lives of LGBTQ young peopleâ\u0080\u0093every single day</p><p>Outstanding benefits, including:</p><p>Comprehensive health insurance, including plan coverage for various gender affirmation care (and we pay 100% of your employee contribution premiums for medical, dental, vision, AND basic life insurance)</p><p>403(b) retirement plan with 3% match</p><p>Generous vacation and 13 paid holidays (one of our holidays is Harvey Milk Day!) plus two floating holidays and three half-day Fridays during the summer</p><p>Employee Assistance Program to&nbsp; help with confidential emotional support, work-life solutions, financial solutions, legal assistance, or online support</p><p>In-network mental health office and virtual visits are covered at 100%, and out-of-network visits are covered at an enhanced level.</p><p>Remote work from the continental US, Alaska, or Hawaii (we provide the technology, a monthly internet reimbursement, and reimbursement to outfit your work-from-home space!)</p><p>Professional and Learning Development Trainings/Education: including a professional subscription to LinkedIn Learning, providing access to more than 13,000 high-quality on-demand courses.</p><p>Online Subscription to Headspace, a digital mindfulness and meditation platform</p><p><br></p><p><br></p><p><br></p><p><span style=\"font-size: 10pt\">The Trevor Project provides equal employment opportunities (EEO) to all employees and qualified applicants for employment without regard to race, color, religion, sex, gender, gender identity or expression, sexual orientation, national origin, age, disability, genetic information, veteran status, or any other status protected by applicable law or policy. The Trevor Project complies with all applicable laws regarding equal opportunity in employment.</span></p><p><br></p><p>The Trevor Project is committed to the full inclusion of all qualified individuals. As part of this commitment, we will ensure that persons with disabilities are provided reasonable accommodations. If a reasonable accommodation is needed to participate in the job application or interview process, please submit a request&nbsp;<a class=\"postings-link\" href=\"https://t.lever-analytics.com/email-link?dest=https%3A%2F%2Fdocs.google.com%2Fforms%2Fd%2Fe%2F1FAIpQLScsi_KC_J-Bum3154ABL0JtWPOGtYwaAjFQcTH5zhVS471cQQ%2Fviewform%3Fusp%3Dsf_link&amp;eid=35813fcb-4880-4aa8-ab15-3ca1abbfe81d&amp;idx=0&amp;token=jzHWQdCZ5C7osFH2CPo-ji7qM54\">here</a>.&nbsp; Please do not disclose medical information in this formâ\u0080\u0093this information will be viewed only by our benefits team and will remain secure. This form is only for those requiring a reasonable accommodation to participate in the job application or interview process. This form is not an application - you must still apply through The Trevor Project careers website.&nbsp;</p><br/><br/>Please mention the word **WORKABLE** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "requirements": [
      "training",
      "support",
      "travel",
      "financial",
      "education",
      "management",
      "senior",
      "operations",
      "operational",
      "legal",
      "health",
      "educational",
      "non tech"
    ],
    "salary_min": 65000,
    "salary_max": 150000,
    "job_type": "Full-time",
    "remote": true,
    "posted_date": "2025-08-12T20:00:18",
    "source": "RemoteOK",
    "url": "https://remoteOK.com/remote-jobs/remote-public-training-associate-the-trevor-project-1093803",
    "seniority_level": "Junior"
  },
  {
    "job_id": "remoteok_1093794",
    "title": "Backend Software Engineer Client Group",
    "company": "Virta Health",
    "location": "Remote",
    "description": "<h1><strong>Backend Software Engineer â\u0080\u0093 Client Group</strong></h1><p style=\"min-height:1.5em\">Virta Health is on a mission to transform type 2 diabetes and weight-loss care. Current treatment approaches arenâ\u0080\u0099t workingâ\u0080\u0094over half of US adults have either type 2 diabetes or prediabetes, and obesity rates are at an all-time high. Virta is changing this by helping people reverse their metabolic condition through innovations in technology, personalized nutrition, and virtual care delivery reinvented from the ground up. We have raised over $350 million from top-tier investors, and partner with the largest health plans, employers, and government organizations to help their employees and members restore their health and take back their lives. Join us on our mission to reverse diabetes and obesity in one billion people.</p><p style=\"min-height:1.5em\">As a Backend Engineer, youâ\u0080\u0099ll build reliable systems, improve data accuracy across member, client, and operational workflows, and automate processes that are critical to Virtaâ\u0080\u0099s ability to deliver seamless care and transparent reporting. Your work will enable faster decision-making, reduce manual processes, and ensure our data is accurate, accessible, and ready to support both internal teams and external partners.</p><p style=\"min-height:1.5em\">Weâ\u0080\u0099re also excited to find someone who brings an AI-augmented mindset, using modern tools and techniques to enhance development workflows and spot opportunities to embed AI into processes where it adds value.</p><p style=\"min-height:1.5em\"></p><h1><strong>What Youâ\u0080\u0099ll Do</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Build and enhance scalable Golang microservices to power eligibility, coverage, billing, and client-facing systems.</p></li><li><p style=\"min-height:1.5em\">Automate and streamline operational workflows, helping to reduce manual data handling and improve the accuracy and availability of member and client data.</p></li><li><p style=\"min-height:1.5em\">Design and deliver self-service tools that allow finance, operations, and client teams to manage processes and configurations independently, reducing reliance on engineering.</p></li><li><p style=\"min-height:1.5em\">Ensure member, client, and operational data is accurate, consistent, and traceable, supporting both internal decision-making and external reporting.</p></li><li><p style=\"min-height:1.5em\">Work with data and AI teams to explore opportunities to apply AI to data validation, process automation, and anomaly detection.</p></li><li><p style=\"min-height:1.5em\">Contribute to client-facing APIs that enable seamless data exchange between Virta and our customers.</p></li></ul><h1><strong>What Weâ\u0080\u0099re Looking For</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5-7 years of shipping backend code in a high quality production environment, with exposure to data centric systems</p></li><li><p style=\"min-height:1.5em\">Experience building microservices in production</p></li><li><p style=\"min-height:1.5em\">Experience with data and event-based architectures (API development, SQL/NoSQL datastores, messaging queues, etc.)</p></li><li><p style=\"min-height:1.5em\">Experience with Golang</p></li><li><p style=\"min-height:1.5em\">Experience with a cloud platform such as Google Cloud, AWS and/or Azure</p></li><li><p style=\"min-height:1.5em\">Strong communication skills and a proven history of interfacing with business-level stakeholders, both technical and non-technical alike</p></li><li><p style=\"min-height:1.5em\">Being a champion of long-term thinking and striving to make a business impact without sacrificing engineering quality</p></li></ul><h1><strong>Bonuses</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Practical use of AI tools to accelerate development workflows or enhance data processes.</p></li><li><p style=\"min-height:1.5em\">Light frontend skills for full-stack moments.Â </p></li><li><p style=\"min-height:1.5em\">Exposure to healthcare, fintech, or other regulated domains where data integrity is paramount.</p></li></ul><h1><strong>Values-driven culture</strong></h1><p style=\"min-height:1.5em\">Virtaâ\u0080\u0099s company values drive our culture, so youâ\u0080\u0099ll do well if:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You put <u>people first</u> and take care of yourself, your peers, and our patients equally</p></li><li><p style=\"min-height:1.5em\">You have a strong sense of <u>ownership</u> and take initiative while empowering others to do the same</p></li><li><p style=\"min-height:1.5em\">You prioritize positive <u>impact</u> over busy work</p></li><li><p style=\"min-height:1.5em\">You have <u>no ego</u> and understand that everyone has something to bring to the table regardless of experience</p></li><li><p style=\"min-height:1.5em\">You appreciate <u>transparency</u> and promote trust and empowerment through open access of information</p></li><li><p style=\"min-height:1.5em\">You are <u>evidence-based</u> and prioritize data and science over seniority or dogma</p></li><li><p style=\"min-height:1.5em\">You <u>take risks and rapidly iterate</u></p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Is this role not quite what you're looking for? <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://jobs.ashbyhq.com/virtahealth/form/talent-community-form\"><u>Join our Talent Community</u></a> and <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.linkedin.com/company/virta-health\"><u>follow us on Linkedin</u></a> to stay connected!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>Virta has a location based compensation structure. Starting pay will be based on a number of factors and commensurate with qualifications &amp; experience. For this role, the compensation range is $145,491 - $187,900.Â  Information about Virtaâ\u0080\u0099s benefits is on our Careers page at: </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.virtahealth.com/careers\"><em>https://www.virtahealth.com/careers</em></a><em>.Â </em></p><p style=\"min-height:1.5em\"><em>As part of your duties at Virta, you may come in contact with sensitive patient information that is governed by HIPAA. Throughout your career at Virta, you will be expected to follow Virta's security and privacy procedures to ensure our patients' information remains strictly confidential. Security and privacy training will be provided.</em></p><p style=\"min-height:1.5em\"><em>As a remote-first company, our team is spread across various locations with office hubs in Denver and San Francisco. </em><br /><em><u>Clinical roles:</u> We currently <strong>do not hire </strong>in the following states: AK, HI, RI<br /><u>Corporate roles:</u> We currently <strong>do not hire </strong>in the following states: AK, AR, DE, HI, ME, MS, NM, OK, SD, VT, WI.</em></p><p style=\"min-height:1.5em\"><em>#LI-remote</em></p><br/><br/>Please mention the word **OPULENT** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "requirements": [
      "software",
      "frontend",
      "security",
      "training",
      "full-stack",
      "technical",
      "support",
      "code",
      "cloud",
      "operational",
      "golang",
      "medical",
      "health",
      "engineer",
      "engineering",
      "backend"
    ],
    "salary_min": 70000,
    "salary_max": 100000,
    "job_type": "Full-time",
    "remote": true,
    "posted_date": "2025-08-10T15:00:05",
    "source": "RemoteOK",
    "url": "https://remoteOK.com/remote-jobs/remote-backend-software-engineer-client-group-virta-health-1093794",
    "seniority_level": "Mid-level"
  },
  {
    "job_id": "remoteok_1093792",
    "title": "Payment QR Code from Eye AI",
    "company": "CrowdGen by Appen",
    "location": "Remote",
    "description": "<p>Join us in shaping the future of image recognition technology! This is your chance to contribute by simply sharing photos.</p><p><br></p><p>Be part of this exciting projectâ\u0080\u0094start contributing today! \\uD83D\\uDCF8â\u009c¨</p><p><br></p><p>Thereâ\u0080\u0099s no limit to how many images you can submit to Appen, and participation is flexibleâ\u0080\u0094you just need to complete your assigned session.</p><p><br></p><p><br></p><p>REQUIREMENTS:</p><p>- All participants must be 18 years of age or older</p><p>- Own a smartphone device</p><p>- Has a stable internet connection to use our Appen Mobile App and upload your pictures</p><p>- Must be residing in India where your CrowdGen account is registered when completing the task.</p><p><br></p><p>Task:</p><p>We are specifically looking for UPI Payment QR Code Photos</p><p>- Capture Unique Images of Payment QR code that you commonly sees in markets, stores, restaurants, cafes, and other establishments.</p><p>- Using your smartphoneâ\u0080\u0099s rear camera</p><p>- Capture image in portrait mode</p><p>- Minimum resolution of 1080x1920</p><p>- Pretend you're buying something while wearing smart glasses. Look at the UPI payment QR code and step back a bit (about 3-6 feet away). Hold your phoneâ\u0080\u0099s rear camera, facing out, next to your left eye, stand straight up, tilt your head if you need to, and capture code.</p><p>- Donâ\u0080\u0099t use the selfie camera or filters.</p><p>- Don't stand too far away or lean in too close.</p><p>- Donâ\u0080\u0099t use an angle where the QR code details can no longer be seen.</p><p><br></p><p>List of Providers:</p><p>Google Pay</p><p>Phonepe</p><p>BharatPe</p><p>PayZapp</p><p>Paytm</p><p>Mobikwik</p><p>others</p><p><br></p><p>PAYMENT:</p><p>- You will receive a pay rate of 0.50 USD per image</p><p>- Only images passed QA will be accepted and eligible for payment.</p><p>- Rejected images will not be paid.</p><p>- Please note, that the pay rate displayed represents the amount of each accepted image you submit.</p><p><br></p><p>Note:</p><p>Once you are active in the project and selected to complete the task:</p><p>- we will contact you with a welcome email containing your app login details (PIN).</p><p>- you have a window of 1-2 days to complete the task upon the issuance of the PINS.</p><p>- If not, the PIN will expire, and the task will be reassigned to another participant.</p><p>-In case you cannot complete the 5 images per PIN, you can just submit whatever photos you have.</p><p>- After the PIN expires, we will send whatever images you submit for quality checking.</p><p>- seize the opportunityâ\u0080\u0094it's first come, first served!</p><p>- If your submitted images meet our quality standards and pass the quality check, we may offer you a chance to receive a new set of pins. We'll contact you once you're eligible</p>\\n<p></p><p><br></p><p></p>\\n<div>$0.50 - $0.50 one-time</div>\\n<br/><br/>Please mention the word **SUFFICIENT** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "requirements": [
      "code",
      "qa",
      "mobile"
    ],
    "salary_min": 50000,
    "salary_max": 100000,
    "job_type": "Full-time",
    "remote": true,
    "posted_date": "2025-08-10T12:00:08",
    "source": "RemoteOK",
    "url": "https://remoteOK.com/remote-jobs/remote-payment-qr-code-from-eye-ai-crowdgen-by-appen-1093792",
    "seniority_level": "Mid-level"
  },
  {
    "job_id": "remoteok_1093779",
    "title": "Human Resources Associate Mid level",
    "company": "CoinGecko",
    "location": "Remote",
    "description": "<p>CoinGecko is a global leader in tracking cryptocurrency data. Operating since 2014, CoinGecko has built the world's largest cryptocurrency data platform, tracking over 10,000 tokens across more than 400 exchanges, serving over 300 million page views in more than 100 countries. We are proud to have played a major part in mainstream awareness, adoption, and education of cryptocurrency globally.</p><p><br></p><p>We at CoinGecko believe that cryptocurrency and blockchain will define the future of finance, bringing greater financial and economic freedom around the world. In anticipation of that future, CoinGecko is building the foundation to scale cryptocurrency market data to serve billions.</p><p><br></p><p><u>We practice transparent salaries and a level structure at CoinGecko:</u></p><p>â\u0080¢ The salary for this position is RM9,481. </p><p>â\u0080¢ Learn more about our level structure at <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.coingecko.com/en/careers/career-progression\">CoinGecko's Career Progression</a>. </p><p><br></p><p><b>Please&nbsp;note&nbsp;that&nbsp;this&nbsp;is&nbsp;a&nbsp;remote&nbsp;role&nbsp;for&nbsp;those&nbsp;based&nbsp;in&nbsp;Selangor&nbsp;or&nbsp;Kuala&nbsp;Lumpur,&nbsp;Malaysia.</b></p>\\n<p></p><p><br></p><b>What You Will Be Doing</b><ul><li><b>HR Operations</b>: Own the end-to-end HR operational lifecycle, including flawless execution of monthly payroll and claims, statutory submissions (EPF, SOCSO, EIS, LHDN, HRDC), benefits administration, employee offboarding, and contract management. You will also serve as the primary contact for all employee HR queries.</li><li><b>Workplace &amp; Engagement Support: </b>Enhance the employee experience by managing office administration, coordinating company-wide events like townhalls, and administering employee engagement surveys (e.g., eNPS).&nbsp;</li><li><b>Learning &amp; Development:</b> Research and create learning structures and processes for employees to upskill. Coordinate all learning and development logistics, including managing relationships with training vendors, scheduling sessions, and owning the HRDC claims and reporting process.</li><li><b>Employee Relations:</b> Provide confidential administrative support for employee relations matters, including grievances, conflict resolution, and disciplinary actions. Ensure compliance with all relevant HR laws and regulations.</li><li><b>Performance Management: </b>Support the effective implementation of performance management initiatives by administering the process in our HR systems, tracking submissions, and preparing support documents for employees and managers.</li><li><b>Compensation &amp; Benefits</b>: Support the analysis of our total rewards structure by preparing accurate data for annual compensation reviews, bonus cycles, and benefits analysis.</li><li><b>Organization Design:</b> Participate in activities to support the organization's structure, including preparing job descriptions, job roles, hierarchies, and reporting lines.&nbsp;</li><li><b>HR Reporting: </b>Own the preparation of monthly/quarterly/annual HR reports. This involves gathering and cleaning data on key metrics like headcount, new hires, and turnover, providing the foundation for strategic analysis.</li><li><b>Vendor Management</b>: Maintain effective communication and manage relationships with external parties such as insurance providers, benefits brokers, training providers, and HR system vendors.</li><li><b>Documentation:</b> Create, maintain, and improve HR operational guidelines, process checklists, and standard templates to build a scalable foundation for the company.</li><li><b>Plugged-In:</b> Stay up-to-date with emerging trends and technologies in HR operations and contribute to the continuous improvement of our processes and systems.</li><li><b>Collaboration:</b> Work collaboratively with all stakeholders to complete projects in a timely and effective manner. Act as a trusted partner to the business, providing clear and helpful answers to HR-related questions.</li><li><b>Coaching:</b> Able to mentor interns. Mentorship includes imparting knowledge and/or technical skills for day-to-day work.</li><li>You are required to support any ad hoc tasks as required by the company.</li></ul><p><br></p><b>What We Look For In You</b><ul><li><b>Proven Track Tecord:</b> You have 3-5 years experience in a hands-on HR Operations or HR Generalist role.</li><li><b>Education: </b>You have a Bachelorâ\u0080\u0099s degree (any field).</li><li><b>HR Knowledge:</b> You have strong, practical knowledge of the Malaysian Employment Act 1955 and core HR operational functions. Expertise in payroll processing and statutory compliance (EPF, SOCSO, EIS, LHDN, HRDC) and exposure to other HR areas is a strong advantage.</li><li><b>Domain Knowledge: </b>You demonstrate the ability to pick up knowledge of internal HR platforms (ATS, HRIS, etc.), blockchain/cryptocurrency industry and domain knowledge, as well as overall business and department operations quickly.</li><li><b>Entrepreneurial: </b>You are self-motivated, resourceful, and have an entrepreneurial mindset with the ability to succeed in a fast-paced and highly agile environment.</li><li><b>Analytical &amp; Data-driven:</b> You are meticulous with data, ensuring its accuracy and integrity. You are comfortable preparing reports and dashboards that will be used for strategic decision-making.</li><li><b>Operational Excellence: </b>You are able to frequently spot and prevent errors and have an exceptionally high bar for accuracy and quality. You also hold your peers to similar standards in their work.</li><li><b>Integrity:</b> You demonstrate sound judgment and have proven experience handling highly sensitive and confidential data with the utmost discretion.</li><li><b>Strong Opinions, Loosely Held: </b>You are humble in embracing better ideas from others, eager to improve things, and open to challenges and possibilities.</li><li><b>Project Management: </b>You take ownership of your responsibilities, ensuring all operational cycles and deliverables are met within the agreed timeline.</li><li><b>Leadership:</b> You are self-motivated and can work independently with minimal supervision. You have a strong sense of self-leadership and are curious and creative in finding ways to improve existing projects and workflows.</li><li><b>Problem-Solving:</b> You demonstrate the ability to figure out solutions to hard problems with many constraints, using sound judgment to assess risks, and to lay out your argument in a well-structured, data-informed, written narrative. You have a passion to solve people's problems while balancing business goals and peopleâ\u0080\u0099s needs.</li><li><b>People Skills: </b>You are an excellent communicator who can build working relationships with all stakeholders. You have the proven ability to engage with candidates, internal staff, vendors, and company leaders in a constructive and collaborative relationship.&nbsp;</li><li><b>Growth Mindset: </b>You love learning new systems and finding more efficient ways of doing things. You see this role as an opportunity to build a best-in-class HR operational function from the ground up.</li><li><b>Web3 Interest: </b>You have a keen interest in blockchain, cryptocurrency, NFT, web3, and metaverse topics.</li></ul><p><br></p><p></p>\\n<p><b style=\"font-size: 16px\">Perks at CoinGecko:</b></p><p><span style=\"font-size: 16px\">â\u0080¢ </span><b style=\"font-size: 16px\">Remote Work Flexibility</b><span style=\"font-size: 16px\">: Work wherever you feel most productive. We also provide office space in 1Powerhouse (Malaysia) and WeWork (Singapore) if you ever feel like meeting your colleagues in person.</span></p><p><span style=\"font-size: 16px\">â\u0080¢ </span><b style=\"font-size: 16px\">Flexible Working Hours</b><span style=\"font-size: 16px\">: No 9-5 structure, work the hours you need to get your tasks done.</span></p><p><span style=\"font-size: 16px\">â\u0080¢ </span><b style=\"font-size: 16px\">Comprehensive Insurance Coverage</b><span style=\"font-size: 16px\">: </span><span style=\"font-size: 16px;\">We provide life and hospitalization coverage for you, along with hospitalization coverage for your dependents. </span></p><p><span style=\"font-size: 16px\">â\u0080¢ </span><b style=\"font-size: 16px\">Virtual Share Options</b><span style=\"font-size: 16px\">: You'll be entitled to virtual options, with terms and conditions.</span></p><p><span style=\"font-size: 16px\">â\u0080¢ </span><b style=\"font-size: 16px\">Bonus</b><span style=\"font-size: 16px\">: Youâ\u0080\u0099ll be entitled to a bonus, with terms and conditions.</span></p><p><span style=\"font-size: 16px\">â\u0080¢&nbsp;</span><b style=\"font-size: 16px\">Parking Allowance</b><span style=\"font-size: 16px\">: You will be given a monthly fixed allowance of RM 150 or SGD 100 to ease the cost of traveling.</span></p><p><span style=\"font-size: 16px\">â\u0080¢&nbsp;</span><b style=\"font-size: 16px\">Meal Allowance</b><span style=\"font-size: 16px\">: You will be given a monthly fixed allowance of RM600 or SGD400 to subsidize the cost of your meals.</span></p><p><span style=\"font-size: 16px\">â\u0080¢&nbsp;</span><b style=\"font-size: 16px\">Learning Allowance</b><span style=\"font-size: 16px\">: You will be allocated an annual budget of USD500 (claim basis) to help you continuously learn in the pursuit of your professional and personal development.</span></p><p><span style=\"font-size: 16px\">â\u0080¢&nbsp;</span><b style=\"font-size: 16px\">Social Activity Allowance</b><span style=\"font-size: 16px\">: Want to set a date to watch a movie or play futsal with your colleagues? Get it organized and we subsidize a portion (claim basis) of the cost.</span></p><p><span style=\"font-size: 16px\">â\u0080¢ </span><b style=\"font-size: 16px\">Annual Company Offsite</b><span style=\"font-size: 16px\">: We gather once a year to meet each other in person, reflect on the year, and partake in social activities!</span></p><p><br></p><p><span style=\"font-size: 16px\">CoinGecko is an equal employment opportunity employer. Qualified candidates are considered for employment without regard to race, religion, gender, gender identity, sexual orientation, national origin, age, military or veteran status, disability, or any other characteristic protected by applicable law.</span></p><p><br></p><p><b style=\"font-size: 16px\"><i>Interested in being a Gecko?</i></b><i style=\"font-size: 16px\">&nbsp;<b>Hit the apply button to get started on your application!</b></i></p><br/><br/>Please mention the word **EULOGIZE** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
    "requirements": [
      "cryptocurrency",
      "hr",
      "system",
      "training",
      "technical",
      "support",
      "payroll",
      "financial",
      "education",
      "leader",
      "management",
      "operations",
      "operational"
    ],
    "salary_min": 0,
    "salary_max": 0,
    "job_type": "Full-time",
    "remote": true,
    "posted_date": "2025-08-08T06:00:07",
    "source": "RemoteOK",
    "url": "https://remoteOK.com/remote-jobs/remote-human-resources-associate-mid-level-coingecko-1093779",
    "seniority_level": "Junior"
  }
]